{
    "title": "Circle Game",
    "description": "<div class=\"panel_content\" style=\"margin:0px;padding:0px 20px;font-size:14px;font-family:'Times New Roman';\">\n\t　　You must have some knowledge with circle games in ACM problems, such as Joseph Ring problem. Today we are going to introduce a new circle game described as follows. There is a circle which contains&nbsp;<strong>M</strong>&nbsp;points, numbered from 0 to M-1. At first, n students stand in different points of the circle. It is possible that more than one student stand in the same point. For each second, each student moves one step forward in clockwise direction. The following picture gives us an example of that M equals to 8 and n equals to 3. Initially, the first student S1 stands in the point 0, the second student S2 stands in the point 2 and the third student stands in the point 7. After 2 seconds, they will change their positions as the right part of the picture.<br />\n<img src=\"http://acm.hdu.edu.cn/data/images/C468-1002-1.jpg\" /><br />\nAt the beginning of the game, Tracy writes down the positions of all students. Then he will go to sleep and students will abide by the above rules to make this game run until Tracy wake up. After a period of time, Tracy wakes up. He finds it is very hard to identify where the first student S1 stands in and where the second student S2 stands in and so on, because all students are the exactly similar and unable to be distinguished. So Tracy records all the positions of students and writes down the XOR sum of these positions (The XOR sum of an array A means A[0] xor A[1] xor … A[n-2] xor A[n-1] and xor is the exclusive or operation, for example 0111 xor 1011 = 1100). Now Tracy wants you to help him to know how many seconds he had slept. To simplify the problem, the number of points is always a power of 2 like 2<sup>m</sup>.&nbsp;<br />\nFurthermore, Tracy knows that the time he slept is not greater than&nbsp;<strong>T</strong>. Please note that the time Tracy slept must be greater than zero. There may have many different periods of time corresponding with the above conditions.\n</div>\n<div>\n\t<br />\n</div>",
    "input": "<span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">　　There are several test cases, each test case firstly contains four integers&nbsp;</span><strong>n, m, S, T</strong><span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">. S is the XOR sum of students’ positions when Tracy wakes up. Another 3 integers n, m, T are described as the above. Then n integers will follow in the next line, which represent the positions of students initially. The input will finish with the end of file.</span><br />\n<span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">0 &lt; n &lt;= 100000, 0 &lt; m &lt;= 50, 0 &lt;= S&lt; 2</span><sup>50</sup><span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">, 0 &lt; T &lt;= 10</span><sup>16</sup><span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">&nbsp;and the student position is in the range [0, 2</span><sup>m</sup><span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">).</span>",
    "output": "<span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;\">　　For each test case, output the number of possible periods of time that Tracy had slept and matched the above restrictions. Please output zero if no time matched.</span>",
    "memory_limit": {
        "unit": "MB",
        "value": 128
    },
    "time_limit": {
        "unit": "s",
        "value": 1.0
    },
    "samples": [
        {
            "input": "3 3 7 5\n0 2 7\n5 3 7 5\n1 2 3 4 5\n4 4 0 10\n1 3 5 7\n6 5 18 100\n22 10 18 20 2 10\n",
            "output": "1\n0\n4\n50\n"
        }
    ],
    "images": [],
    "append": [],
    "template": [],
    "prepend": [],
    "test_cases": [],
    "hint": "<div class=\"__kindeditor_paste__\">\n\t<span style=\"font-family:'Times New Roman';font-size:14px;line-height:normal;background-color:#F4FBFF;\"> 　　For the first test case, the following table explains that only “2 seconds” matched the restrictions. </span><img src=\"http://acm.hdu.edu.cn/data/images/C468-1002-2.jpg\" />\n</div>",
    "source": "动态规划",
    "spj": null,
    "solution": [
        {
            "language": "C++",
            "code": "#include <bits/stdc++.h>\nusing namespace std;\nint a[10]={0,1,0,4,50},n,m;\nlong long b=0,c=0,d=0;\ndouble f,k,j;\nbool cmp;\nlong g;\nint main()\n{\n    for(int i=1;i<=4;i++)\n    cout<<a[i]<<endl;\n\treturn 0;\n}"
        }
    ]
}